## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| add      | `aws_iam_role.database`                                        |
|          | `aws_iam_role_policy_attachment.database_worker`               |
|          | `aws_iam_role_policy_attachment.parameters_csi_database`       |
|          | `aws_iam_role_policy_attachment.secrets_csi_database`          |
| update   | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s` |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
13:52:48.754 STDOUT terraform:   + create
13:52:48.754 STDOUT terraform:   ~ update in-place
13:52:48.754 STDOUT terraform: -/+ destroy and then create replacement
13:52:48.754 STDOUT terraform: Terraform will perform the following actions:
13:52:48.755 STDOUT terraform:   # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
13:52:48.755 STDOUT terraform:   ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
13:52:48.755 STDOUT terraform:         id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
13:52:48.755 STDOUT terraform:       ~ release_version        = "1.33.0-20250715" -> "1.33.3-20250807"
13:52:48.755 STDOUT terraform:         tags                   = {
13:52:48.755 STDOUT terraform:             "CostCenter"             = "notification-canada-ca-production"
13:52:48.755 STDOUT terraform:             "Name"                   = "notification-canada-ca"
13:52:48.755 STDOUT terraform:             "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
13:52:48.755 STDOUT terraform:         }
13:52:48.755 STDOUT terraform:         # (17 unchanged attributes hidden)
13:52:48.755 STDOUT terraform:         # (3 unchanged blocks hidden)
13:52:48.755 STDOUT terraform:     }
13:52:48.755 STDOUT terraform:   # aws_iam_role.database will be created
13:52:48.755 STDOUT terraform:   + resource "aws_iam_role" "database" {
13:52:48.755 STDOUT terraform:       + arn                   = (known after apply)
13:52:48.755 STDOUT terraform:       + assume_role_policy    = jsonencode(
13:52:48.755 STDOUT terraform:             {
13:52:48.755 STDOUT terraform:               + Statement = [
13:52:48.755 STDOUT terraform:                   + {
13:52:48.755 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
13:52:48.755 STDOUT terraform:                       + Condition = {
13:52:48.755 STDOUT terraform:                           + StringEquals = {
13:52:48.755 STDOUT terraform:                               + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
13:52:48.756 STDOUT terraform:                               + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-database"
13:52:48.756 STDOUT terraform:                             }
13:52:48.756 STDOUT terraform:                         }
13:52:48.756 STDOUT terraform:                       + Effect    = "Allow"
13:52:48.756 STDOUT terraform:                       + Principal = {
13:52:48.756 STDOUT terraform:                           + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
13:52:48.756 STDOUT terraform:                         }
13:52:48.756 STDOUT terraform:                     },
13:52:48.756 STDOUT terraform:                 ]
13:52:48.756 STDOUT terraform:               + Version   = "2012-10-17"
13:52:48.756 STDOUT terraform:             }
13:52:48.756 STDOUT terraform:         )
13:52:48.756 STDOUT terraform:       + create_date           = (known after apply)
13:52:48.756 STDOUT terraform:       + force_detach_policies = false
13:52:48.756 STDOUT terraform:       + id                    = (known after apply)
13:52:48.756 STDOUT terraform:       + managed_policy_arns   = (known after apply)
13:52:48.756 STDOUT terraform:       + max_session_duration  = 3600
13:52:48.756 STDOUT terraform:       + name                  = "secrets-csi-role-database"
13:52:48.756 STDOUT terraform:       + name_prefix           = (known after apply)
13:52:48.756 STDOUT terraform:       + path                  = "/"
13:52:48.756 STDOUT terraform:       + tags_all              = (known after apply)
13:52:48.756 STDOUT terraform:       + unique_id             = (known after apply)
13:52:48.756 STDOUT terraform:       + inline_policy (known after apply)
13:52:48.756 STDOUT terraform:     }
13:52:48.756 STDOUT terraform:   # aws_iam_role_policy_attachment.database_worker will be created
13:52:48.757 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "database_worker" {
13:52:48.757 STDOUT terraform:       + id         = (known after apply)
13:52:48.757 STDOUT terraform:       + policy_arn = "arn:aws:iam::296255494825:policy/notification-worker-policy"
13:52:48.757 STDOUT terraform:       + role       = "secrets-csi-role-database"
13:52:48.757 STDOUT terraform:     }
13:52:48.757 STDOUT terraform:   # aws_iam_role_policy_attachment.parameters_csi_database will be created
13:52:48.757 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "parameters_csi_database" {
13:52:48.757 STDOUT terraform:       + id         = (known after apply)
13:52:48.757 STDOUT terraform:       + policy_arn = "arn:aws:iam::296255494825:policy/parameters-csi-policy"
13:52:48.757 STDOUT terraform:       + role       = "secrets-csi-role-database"
13:52:48.757 STDOUT terraform:     }
13:52:48.757 STDOUT terraform:   # aws_iam_role_policy_attachment.secrets_csi_database will be created
13:52:48.757 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "secrets_csi_database" {
13:52:48.757 STDOUT terraform:       + id         = (known after apply)
13:52:48.757 STDOUT terraform:       + policy_arn = "arn:aws:iam::296255494825:policy/secrets-csi-policy"
13:52:48.757 STDOUT terraform:       + role       = "secrets-csi-role-database"
13:52:48.757 STDOUT terraform:     }
13:52:48.757 STDOUT terraform:   # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
13:52:48.757 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
13:52:48.757 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
13:52:48.757 STDOUT terraform:       + has_secret_string_wo = (known after apply)
13:52:48.758 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20250723144029006200000002" -> (known after apply)
13:52:48.758 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
13:52:48.758 STDOUT terraform:       ~ version_id           = "terraform-20250723144029006200000002" -> (known after apply)
13:52:48.758 STDOUT terraform:       ~ version_stages       = [
13:52:48.758 STDOUT terraform:           - "AWSCURRENT",
13:52:48.758 STDOUT terraform:         ] -> (known after apply)
13:52:48.758 STDOUT terraform:         # (4 unchanged attributes hidden)
13:52:48.758 STDOUT terraform:     }
13:52:48.758 STDOUT terraform: Plan: 5 to add, 1 to change, 1 to destroy.
13:52:48.758 STDOUT terraform: Warning: Deprecated attribute
13:52:48.758 STDOUT terraform:   on .terraform/modules/sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
13:52:48.758 STDOUT terraform:   85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"
13:52:48.758 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
13:52:48.758 STDOUT terraform: details.
13:52:48.758 STDOUT terraform: (and 3 more similar warnings elsewhere)
13:52:48.758 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
13:52:48.758 STDOUT terraform: Saved the plan to: plan.tfplan
13:52:48.758 STDOUT terraform: To perform exactly these actions, run the following command to apply:
13:52:48.758 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
